import React from "react";
import { Container } from "react-bootstrap";

const style = { textIndent: "20px" };

export function AboutSite() {
  return (
    <Container fluid>
      <h2 className="text-center m-3">Про Департамент</h2>
      <p style={style}>
        Департамент військової освіти і науки є самостійним структурним
        підрозділом апарату Міністерства оборони України та відповідає за
        ефективне функціонування системи військової освіти і науки у секторі
        національної безпеки та оборони, що базується на забезпеченні державних
        інтересів та дотриманні міжнародних стандартів.
      </p>
      <p style={style}>
        Департамент військової освіти і науки Міністерства оборони України (далі
        — Департамент) визначає головні засади державної політики у сфері
        військової освіти і науки з метою підготовки висококваліфікованих і
        компетентних військових фахівців для Збройних Сил України та інших
        військових формувань.
      </p>
      <p style={style}>
        Департамент підпорядковується Міністру оборони України. Діяльність
        Департаменту спрямовується та координується заступником Міністра оборони
        України (згідно з розподілом обов’язків).
      </p>
      <h4 className="text-center m-3">МІСІЯ</h4>
      <p style={style}>
        Модернізація системи військової освіти і науки задля досягнення
        Збройними Силами України повної взаємосумісності зі збройними силами
        держав — членів НАТО відповідно до чинних нормативно-правових актів та з
        урахуванням національного та міжнародного досвіду.
      </p>
      <p style={style}>
        <b>Головною метою </b>діяльності Департаменту є вироблення державного
        курсу щодо розвитку освітньої і наукової компоненти як складової
        формування національного безпекового середовища в оборонному секторі.
      </p>
      <p style={style}>
        У своїй діяльності Департамент спирається на такі{" "}
        <b>ціннісні орієнтири:</b>
      </p>
      <ul>
        <li>патріотизм і далекоглядність;</li>
        <li>компетентність та самовдосконалення;</li>
        <li>транспарентність і проактивність.</li>
      </ul>
      <h4 className="text-center m-3">ПРІОРИТЕТИ</h4>
      <ul>
        <li>
          Налагодження ефективної та інноваційної системи забезпечення якісної
          освіти у вищих військових навчальних закладах, військових навчальних
          підрозділах закладів вищої освіти, військових ліцеях з використанням
          методологічних новацій та елементів дистанційних форм навчання.
        </li>
        <li>
          Вироблення оптимальної моделі апробації стандартизованих підходів
          держав — членів НАТО у сфері військової освіти і науки.
        </li>
        <li>
          Розроблення дієвого механізму обміну інформацією стосовно наявних
          наукових досліджень і розробок (проривних технологій) з проблем
          підвищення обороноздатності та національної безпеки.
        </li>
        <li>
          Планомірне впровадження уніфікованих програм з мовної підготовки для
          військових фахівців та підтримання належного рівня володіння
          іноземними мовами.
        </li>
      </ul>
      <h4 className="text-center m-3">КЕРІВНИЦТВО</h4>
      <p style={style}>
        Директор — <b>МІРНЕНКО Володимир Іванович</b>, доктор технічних наук,
        професор, заслужений працівник освіти України
      </p>
      <p style={style}>
        Заступник директора — начальник відділу організації освітньої діяльності
        — полковник <b>КАС’ЯНЕНКО Максим Вікторович</b>, кандидат військових
        наук
      </p>
      <p style={style}>
        Заступник директора — начальник відділу організації наукової діяльності
        — полковник <b>ГУПАЛО Андрій Юрійович</b>, кандидат технічних наук
      </p>
    </Container>
  );
}
